#include <iostream>
#include <windows.h>
#include <string>
#include <cmath>

using namespace std;

int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    cout << "Нахождение площади пятиугольника по методу Гаусса\n\n";

    float x1, y1, x2, y2, x3, y3, x4, y4, x5, y5;

    cout << "Введите точки для сетки координат по оси X/Y\n\n";

    cout << "Введите координаты 1-й точки\n";
    cout << "Введите значение по оси x: ";
    cin >> x1;
    cout << "Введите значение по оси y: ";
    cin >> y1;
    cout << "\n";
    cout << "Введите координаты 2-й точки\n";
    cout << "Введите значение по оси x: ";
    cin >> x2;
    cout << "Введите значение по оси y: ";
    cin >> y2;
    cout << "\n";
    cout << "Введите координаты 3-й точки\n";
    cout << "Введите значение по оси x: ";
    cin >> x3;
    cout << "Введите значение по оси y: ";
    cin >> y3;
    cout << "\n";
    cout << "Введите координаты 4-й точки\n";
    cout << "Введите значение по оси x: ";
    cin >> x4;
    cout << "Введите значение по оси y: ";
    cin >> y4;
    cout << "\n";
    cout << "Введите координаты 5-й точки\n";
    cout << "Введите значение по оси x: ";
    cin >> x5;
    cout << "Введите значение по оси y: ";
    cin >> y5;

    float sqr = abs((((x1 * y2) + (x2 * y3) + (x3 * y4) + (x4 * y5) + (x5 * y1)) - ((y1 * x2) + (y2 * x3) + (y3 * x4) + (y4 * x5) + (y5 * x1))) / 2);

    cout << "\nПлощадь пятиугольника равна: " << sqr << "\n\n";
}